# 1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
# зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
# третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном
# порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение
# и завершать скрипт.

from time import sleep
from itertools import count,cycle

class TrafficLights():
    def start(self):
        c = 0
        for el, delay in cycle((('Red', 7), ('Yellow', 2), ('Green', 13))):
            if c > 10:
                break
            print(el)
            sleep(delay)
            c += 1

my_traffic_lights = TrafficLights()
my_traffic_lights.start()