# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен
# быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл. Во втором
# также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count,cycle

def my_count(n):
    for el in count(n):
        if el > 20:
            break
        else:
            print(el)

def my_cycle(cycle_expr, how_many_times):
    c = 0
    for el in cycle(cycle_expr):

        if c >= how_many_times * len(cycle_expr):
            break
        c += 1
        print(el)

print('--------------------------------------------------------------')
my_count(3)
print('--------------------------------------------------------------')
my_cycle('ABC', 6)