# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом. Каждое слово состоит из латинских букв
# в нижнем регистре. Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def int_func(lower_case_string=''):
    return lower_case_string.capitalize()


lower_case_strings = input('Введите строку: ')
lower_case_list = lower_case_strings.split(' ')
space = ' '
print(space.join(list(map(int_func, lower_case_list))))
