# 2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width

    def get_asphalt(self, thickness, expense_norm):
        return self._length * self._width * thickness * expense_norm / 1000

my_road = Road(5000,25)
print(f'Расход асфальта при толщине полотна {5} см и норме рахода {25} кг/0.01м3 составит {my_road.get_asphalt(5,25)} тонн')
